[{"name": "Big Ben", "tagline": "London's iconic national timepiece", "description": "16-storey Gothic clocktower and national symbol at the Eastern end of the Houses of Parliament.", "rank": 1}, {"name": "London Eye", "tagline": "Iconic riverside observation wheel", "description": "Huge observation wheel giving passengers a privileged bird's-eye view of the city's landmarks.", "rank": 2}, {"name": "British Museum", "tagline": "A historian's treasure trove", "description": "Huge showcase for global antiquities, including Egyptian mummies and ancient Greek sculptures.", "rank": 3}, {"name": "Buckingham Palace", "tagline": "Home of the British Queen & State Rooms", "description": "Visitors can tour the palace's opulent private and state rooms or watch the changing of the guard.", "rank": 4}, {"name": "River Thames", "tagline": "Rivers, estuaries, canals, and riverboat", "description": "The River Thames is a river that flows through southern England, most notably through London. At 215 miles, it is the longest river entirely in England and the second longest in the United Kingdom", "rank": 5}, {"name": "Tower Bridge", "tagline": "Iconic Victorian turreted bridge", "description": "Panoramic views from high level walkways and behind-the-scenes access to original lifting machinery.", "rank": 6}, {"name": "Hyde Park", "tagline": "Acres of greenery in Central London", "description": "Huge green space, home to Diana Memorial Fountain, with boating and swimming in the Serpentine lake.", "rank": 7}, {"name": "St Paul's Cathedral", "tagline": "Iconic cathedral's churchyard & garden", "description": "Churchyard and gardens outside Saint Paul's cathedral, with a floor-plan of the original building.", "rank": 8}, {"name": "Trafalgar Square", "tagline": "Nelson's Column, fountains & lions", "description": "Nelson's Column rises above this iconic square's LED-lit fountains, artworks and lion statues.", "rank": 9}, {"name": "Palace of Westminster", "tagline": "Iconic home of UK parliament", "description": "Neo-Gothic masterpiece and seat of the UK government. Guided tours on Saturdays and in summer.", "rank": 10}, {"name": "Covent Garden", "tagline": "Shopping hub & Royal Opera House", "description": "Covent Garden is in the West End, London’s main theatre and entertainment area. Tourists fill its elegant, car-free Piazza, home to fashion stores, crafts at the Apple Market and the Royal Opera", "rank": 11}, {"name": "Westminster Abbey", "tagline": "Gothic church & site for coronations", "description": "Protestant abbey hosting daily services and every English and British coronation since 1066.", "rank": 12}, {"name": "London Bridge", "tagline": "1970s bridge spanning the River Thames", "description": "Concrete pedestrian and traffic bridge that gave a major railway station its name.", "rank": 13}, {"name": "National Gallery, London", "tagline": "Major art from 13th to 19th centuries", "description": "Trafalgar Square art museum whose masterworks trace the development of Western European painting.", "rank": 14}, {"name": "Piccadilly Circus", "tagline": "Bustling Theatreland traffic junction", "description": "Buzzing Theatre-district square with giant neon signs & the 19th-c. Shaftesbury Memorial Fountain.", "rank": 15}, {"name": "Soho", "tagline": "Buzzy area for West End theatre & dining", "description": "The energetic streets of Soho, in the West End, feature an eclectic mix of dining, nightlife and shopping options. Dean, Frith, Beak and Old Compton streets are the epicentre of activity day ", "rank": 16}, {"name": "The Shard", "tagline": "306m-high glass & steel tower with views", "description": "87-floor glass skyscraper with a jagged peak, with restaurants, offices, hotel and viewing platform.", "rank": 17}, {"name": "Oxford Street", "tagline": "Shopping and fashion", "description": "Oxford Street is a major road in the City of Westminster in the West End of London, running from Tottenham Court Road to Marble Arch via Oxford Circus. It is Europe's busiest shopping street,", "rank": 18}, {"name": "Victoria and Albert Museum", "tagline": "World-class decorative art & design", "description": "Blockbuster exhibitions and permanent decorative arts collection, with design shop and ornate cafe.", "rank": 19}, {"name": "Natural History Museum, London", "tagline": "Natural phenomena & hands-on activities", "description": "Landmark museum of animals and natural phenomena, with hands-on exhibits and animatronic dinosaurs.", "rank": 20}, {"name": "Kensington Palace", "tagline": "Royal museum in state residence", "description": "Royal palace and gardens, with exhibits on former residents like Queen Victoria and Princess Diana.", "rank": 21}, {"name": "Camden Town", "tagline": "Camden Market shops & live music", "description": "Camden Town is famed for its market, a warren of fashion and curiosities by the Regent’s Canal. A haven of counter culture, the area is popular with tourists, teenagers and punks. The thriving", "rank": 22}, {"name": "Regent's Park", "tagline": "Cafe & sport centre with changing rooms", "description": "Modern, glass-clad cafe and sports administrative centre, with pitches and changing rooms.", "rank": 23}, {"name": "Tate Modern, London", "tagline": "Contemporary art & cafe with river views", "description": "Modern-art gallery with international works on display, plus a cafe with panoramic river views.", "rank": 24}, {"name": "London King's Cross railway station", "tagline": "Restored 19th-century railway station", "description": "First opened in 1852, this restored train station is a busy hub associated with Harry Potter books.", "rank": 25}, {"name": "Borough Market", "tagline": "Fresh produce & groceries", "description": "Huge market under the railway lines, for British-reared meat and artisanal baked and dairy goods.", "rank": 26}, {"name": "South Bank", "tagline": "Southbank arts complex & London Eye", "description": "Right beside the River Thames, the South Bank is a dynamic area at the heart of London’s cultural scene. The Southbank Centre, National Theatre and BFI film theatre are all world-class arts venues", "rank": 27}, {"name": "St James's Park", "tagline": "Royal park hosting Trooping the Colour", "description": "Green space with a lake with daily pelican feeding, a grass-roofed cafe and ceremonial displays.", "rank": 28}, {"name": "Notting Hill", "tagline": "Portobello Road market & annual Carnival", "description": "Notting Hill is a vibrant, trendy area. Casual cafes line bohemian Portobello Road, famed for its busy market selling antiques and vintage fashion. Filmgoers relax in posh armchairs at the Electric", "rank": 29}, {"name": "London Zoo", "tagline": "Gorillas, giraffes, penguins & tigers", "description": "Major city zoo and research centre helping to conserve numerous species in naturalistic habitats.", "rank": 30}, {"name": "Shakespeare's Globe", "tagline": "Replica of circular Elizabethan theatre", "description": "Oak-and-thatch replica of original Elizabethan theatre, showing Shakespeare plays in the open air.", "rank": 31}, {"name": "Kensington Gardens", "tagline": "Green expanse west of Hyde Park", "description": "Expansive park containing Kensington Palace and the Diana, Princess of Wales Memorial Playground.", "rank": 32}, {"name": "Portobello Road", "tagline": "Market, shopping, and fashion", "description": "Portobello Road is a street in the Notting Hill district of the Royal Borough of Kensington and Chelsea in west London. It runs almost the length of Notting Hill from south to north, roughly ", "rank": 33}, {"name": "Millennium Bridge, London", "tagline": "Steel suspension bridge for pedestrians", "description": "Elegant steel suspension footbridge crossing the Thames from the Tate Modern to St Paul's Cathedral.", "rank": 34}, {"name": "Hampton Court Palace", "tagline": "Henry VIII's royal palace & grounds", "description": "Famous seat of Henry VIII and his many wives, this palace received elegant Stuart-era modernisation.", "rank": 35}, {"name": "London Dungeon", "tagline": "Hi-tech haunted house attraction", "description": "Costumed actors and themed fairground rides depicting macabre stories from London's past.", "rank": 36}, {"name": "Paddington", "tagline": "Paddington station & canal basin bridges", "description": "Paddington blends shiny offices with elegant Georgian townhouses. Paddington station is a busy national rail hub, home to the Heathrow Express. Travellers unwind in hotels near Norfolk Square", "rank": 37}, {"name": "Leicester Square", "tagline": "Theatre and William Shakespeare", "description": "Leicester Square is a pedestrianised square in the West End of London, England. It was laid out in 1670 and is named after the contemporary Leicester House, itself named after Robert Sidney, ", "rank": 38}, {"name": "Museum of London", "tagline": "London stories from prehistory to today", "description": "Artifacts and interactives chronicle London's turbulent history from pre-Roman to modern times.", "rank": 39}, {"name": "Royal Observatory, Greenwich", "tagline": "Astronomy centre on the Prime Meridian", "description": "Wren's 18th-century astronomical observatory on the Prime Meridian, now a museum with a planetarium.", "rank": 40}, {"name": "The Royal Albert Hall", "tagline": "Landmark Victorian concert hall", "description": "One of Britain's great Victorian splendours, most famous for the Proms classical music festival.", "rank": 41}, {"name": "Kings Cross, London", "tagline": "King’s Cross station & British Library", "description": "King’s Cross is a major rail hub, with national trains at King’s Cross station and the Eurostar terminal at St. Pancras. The revitalised Regent's Canal area has offices, landscaped walkways and", "rank": 42}, {"name": "Brick Lane", "tagline": "Street art, shopping, fashion, and art", "description": "Brick Lane is a street in the East End of London, in the Borough of Tower Hamlets. It runs from Swanfield Street in Bethnal Green, crosses Bethnal Green Road in Shoreditch, passes through Spitalfields", "rank": 43}, {"name": "Camden Market", "tagline": "Stalls & shops with an alternative bias", "description": "Eclectic market with youthful vibe and stalls/shops selling fashion and accessories, music and more.", "rank": 44}, {"name": "Royal Botanic Gardens, Kew", "tagline": "Plants from the Arctic to the Tropics", "description": "Trees and flowers from around the globe in vast gardens with huge greenhouses and Treetop Walkway.", "rank": 45}, {"name": "Madame Tussauds London", "tagline": "Wax museum featuring notable celebrities", "description": "Museum chain for life-size wax replicas of famous celebrities & historic icons in themed galleries.", "rank": 46}, {"name": "Science Museum, London", "tagline": "Hands-on exhibits in dozens of galleries", "description": "A vast treasury of science and invention, famous for its state-of-the-art interactive exhibits.", "rank": 47}, {"name": "Westminster Bridge", "tagline": "Clock tower and river", "description": "Arched Victorian road bridge, with pavements", "rank": 48}, {"name": "Sea Life London Aquarium", "tagline": "Aquarium, penguin, jellyfish, and seahorse", "description": "The Sea Life London Aquarium is located on the ground floor of County Hall on the South Bank of the River Thames in central London, near the London Eye. It opened in March 1997 as the London ", "rank": 49}, {"name": "Monument to the Great Fire of London", "tagline": "311-step, Great Fire of London memorial", "description": "Sir Christopher Wren-designed column commemorating London's Great Fire, with a viewing platform.", "rank": 50}]